In [8]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pandas in c:\users\loren nascimento\appdata\roaming\python\python312\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\loren nascimento\appdata\roaming\python\python312\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\loren nascimento\appdata\roaming\python\python312\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\loren nascimento\appdata\roaming\python\python312\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\loren nascimento\appdata\roaming\python\python312\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\loren nascimento\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
import pandas as pd
data = {'Nome': ['Alice', 'João', 'Ana'], 'Idade': [25,30,35]}
df = pd.DataFrame(data)
df
nomeColuna = df['Nome']
nomeColuna

0    Alice
1     João
2      Ana
Name: Nome, dtype: object

In [10]:
dfCondicional = df[df['Idade'] > 30]
dfCondicional

  Nome  Idade
2  Ana     35

In [11]:
df

    Nome  Idade
0  Alice     25
1   João     30
2    Ana     35

In [16]:
#inserindo nova coluna 
df['Salário'] = [5000, 3000, 7000]
df

    Nome  Idade  Salário
0  Alice     25     5000
1   João     30     3000
2    Ana     35     7000

In [14]:
df=df.drop('Salário', axis=1)

In [17]:
df

    Nome  Idade  Salário
0  Alice     25     5000
1   João     30     3000
2    Ana     35     7000